import re


def ipv4_addresses(text):
    # вираз для IPv4-адрес
    pattern = r'\b(?:25[0-5]|2[0-4][0-9]|1?[0-9]?[0-9])\.' \
              r'(?:25[0-5]|2[0-4][0-9]|1?[0-9]?[0-9])\.' \
              r'(?:25[0-5]|2[0-4][0-9]|1?[0-9]?[0-9])\.' \
              r'(?:25[0-5]|2[0-4][0-9]|1?[0-9]?[0-9])\b'
    return re.findall(pattern, text)

text = """
Ось деякі IP-адреси:
192.168.1.1, 255.255.255.255, 0.0.0.0, 127.0.0.1.
Недійсні адреси: 256.256.256.256, 123.456.78.90, 192.168.1.999.
"""

ipv4_addresses = ipv4_addresses(text)
print("Знайдені IPv4-адреси:", ipv4_addresses)
